---
title: SlabShapeFailures
classe: Autodesk.Revit.DB.BuiltInFailures+SlabShapeFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# SlabShapeFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId SlabShapeEditFailed { get; }` | `SlabShapeFailures.SlabShapeEditFailed` | FailureDefinitionId |
| `FailureDefinitionId SlabShapeEditFailedError { get; }` | `SlabShapeFailures.SlabShapeEditFailedError` | FailureDefinitionId |
| `FailureDefinitionId SlabShapeFailedNotHorz { get; }` | `SlabShapeFailures.SlabShapeFailedNotHorz` | FailureDefinitionId |
| `FailureDefinitionId SlabShapeFailedNotOnlyLines { get; }` | `SlabShapeFailures.SlabShapeFailedNotOnlyLines` | FailureDefinitionId |
| `FailureDefinitionId SlabShapeFailedTooThin { get; }` | `SlabShapeFailures.SlabShapeFailedTooThin` | FailureDefinitionId |
| `FailureDefinitionId SlabShapeWarnVerticesCoincident { get; }` | `SlabShapeFailures.SlabShapeWarnVerticesCoincident` | FailureDefinitionId |
| `FailureDefinitionId SlabShapeWarnVerticesDeleted { get; }` | `SlabShapeFailures.SlabShapeWarnVerticesDeleted` | FailureDefinitionId |
| `FailureDefinitionId SlopedInnerEdge { get; }` | `SlabShapeFailures.SlopedInnerEdge` | FailureDefinitionId |
| `FailureDefinitionId SlopeTailInsideSlopeLine { get; }` | `SlabShapeFailures.SlopeTailInsideSlopeLine` | FailureDefinitionId |
| `FailureDefinitionId SlopeZero { get; }` | `SlabShapeFailures.SlopeZero` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```